app/controllers/comics_controller.rb

SELECT * FROM "comics" LIMIT 1
SELECT * FROM "issues" WHERE ("issues".comic_id = 1) AND ("issues".comic_id = 1) ORDER BY created_at LIMIT 1
---
  def index
    @comic = Comic.first
      @issue = @comic.issues.recent.first

SELECT * FROM "comics" WHERE ("comics"."id" = 1)
---
  def show
    @comic = Comic.find(params[:id])

INSERT INTO "comics" ("updated_at", "title", "description", "about", "created_at") VALUES('2010-01-17 06:23:16', 'Do you Dream in Color?', 'Blagedy blue!', 'Hai!', '2010-01-17 06:23:16')
---
  def create
    @comic = Comic.new(params[:comic])
    if @comic.save