app/controllers/issues_controller.rb

SELECT * FROM "issues"
---
  def index
    @issues = Issue.all

SELECT * FROM "issues" WHERE ("issues"."id" = 1)
---
  def show
    @issue = Issue.find(params[:id])

SELECT * FROM "issues" WHERE ("issues"."id" = 1)
---
  def edit
    @issue = Issue.find(params[:id])

SELECT * FROM "issues" WHERE ("issues"."id" = 1)
UPDATE "issues" SET "content" = 'Hola! This is the first issue.', "updated_at" = '2010-01-15 04:31:59' WHERE "id" = 1
---
  def update
    @issue = Issue.find(params[:id])
    if @issue.update_attributes(params[:issue])