app/controllers/welcome_controller.rb

SELECT * FROM "issues" LIMIT 1
---
  def index
    @issue = Issue.latest